Repository: BlueWallet/BlueWallet
Catalog: ios/ShareExtension/Localizable.xcstrings
Source language: en
Languages: es, fr

# share_error_could_not_open
source: BlueWallet could not be opened.
es: No se pudo abrir BlueWallet.
fr: Impossible d’ouvrir BlueWallet.

# share_error_image_too_large
source: The shared image is too large.
es: La imagen compartida es demasiado grande.
fr: L’image partagée est trop volumineuse.

# share_error_image_dimensions_too_large
source: The shared image has dimensions that are too large. Choose an image smaller than 16 megapixels.
es: Las dimensiones de la imagen compartida son demasiado grandes. Elige una imagen de menos de 16 megapíxeles.
fr: Les dimensions de l’image partagée sont trop grandes. Choisissez une image de moins de 16 mégapixels.

# share_error_import_failed
source: BlueWallet couldn’t scan this image for a QR code.
es: BlueWallet no pudo buscar un código QR en esta imagen.
fr: BlueWallet n’a pas pu rechercher de code QR dans cette image.

# share_error_qr_not_found
source: No QR code was found in the shared image.
es: No se encontró ningún código QR en la imagen compartida.
fr: Aucun code QR n’a été trouvé dans l’image partagée.

# share_error_storage_unavailable
source: BlueWallet shared storage is unavailable.
es: El almacenamiento compartido de BlueWallet no está disponible.
fr: Le stockage partagé de BlueWallet est indisponible.

# share_error_unreadable_image
source: The shared image could not be read.
es: No se pudo leer la imagen compartida.
fr: Impossible de lire l’image partagée.

# share_error_unsupported_image
source: Share one supported image at a time.
es: Comparte una imagen compatible a la vez.
fr: Partagez une seule image compatible à la fois.

# share_ui_cancel
source: Cancel
es: Cancelar
fr: Annuler

# share_ui_close
source: Close
es: Cerrar
fr: Fermer

# share_ui_close_hint
source: Closes the share sheet without opening the QR code.
es: Cierra la hoja para compartir sin abrir el código QR.
fr: Ferme la feuille de partage sans ouvrir le code QR.

# share_ui_failure_title
source: Couldn’t scan this image
es: No se pudo escanear esta imagen
fr: Impossible d’analyser cette image

# share_ui_found_message
source: The decoded content is ready to open in BlueWallet.
es: El contenido decodificado está listo para abrirse en BlueWallet.
fr: Le contenu décodé est prêt à être ouvert dans BlueWallet.

# share_ui_found_title
source: QR code detected
es: Código QR detectado
fr: Code QR détecté

# share_ui_help
source: View Apple’s guide
es: Ver la guía de Apple
fr: Voir le guide Apple

# share_ui_image_preview
source: Shared image preview
es: Vista previa de la imagen compartida
fr: Aperçu de l’image partagée

# share_ui_open
source: Open in BlueWallet
es: Abrir en BlueWallet
fr: Ouvrir dans BlueWallet

# share_ui_open_hint
source: Opens the detected QR code in BlueWallet.
es: Abre el código QR detectado en BlueWallet.
fr: Ouvre le code QR détecté dans BlueWallet.

# share_ui_opening
source: Opening BlueWallet…
es: Abriendo BlueWallet…
fr: Ouverture de BlueWallet…

# share_ui_processing_message
source: Looking for a QR code in the selected image.
es: Buscando un código QR en la imagen seleccionada.
fr: Recherche d’un code QR dans l’image sélectionnée.

# share_ui_processing_title
source: Scanning image
es: Escaneando imagen
fr: Analyse de l’image

# share_ui_qr_preview
source: Detected QR code preview
es: Vista previa del código QR detectado
fr: Aperçu du code QR détecté

# share_recovery_import_failed
source: Open the image in Photos, take a screenshot, crop it closely around the QR code, then share the screenshot to BlueWallet.
es: Abre la imagen en Fotos, haz una captura, recórtala alrededor del código QR y comparte la captura con BlueWallet.
fr: Ouvrez l’image dans Photos, faites une capture d’écran, recadrez-la autour du code QR, puis partagez-la avec BlueWallet.

# share_recovery_image_too_large
source: In Photos, crop the image closely around the QR code or take a screenshot, then share the smaller image again.
es: En Fotos, recorta la imagen alrededor del código QR o haz una captura y vuelve a compartir la imagen más pequeña.
fr: Dans Photos, recadrez l’image autour du code QR ou faites une capture d’écran, puis partagez l’image réduite.

# share_recovery_open_bluewallet
source: Open BlueWallet once, return to Photos, select one image, tap Share, then choose BlueWallet again.
es: Abre BlueWallet una vez, vuelve a Fotos, selecciona una imagen, toca Compartir y elige BlueWallet de nuevo.
fr: Ouvrez BlueWallet une fois, revenez dans Photos, sélectionnez une image, touchez Partager, puis choisissez à nouveau BlueWallet.

# share_recovery_qr_not_found
source: Use a sharp image with one complete QR code. Crop away surrounding text and buttons, then share it again.
es: Usa una imagen nítida con un solo código QR completo. Recorta el texto y los botones que lo rodean y vuelve a compartirla.
fr: Utilisez une image nette contenant un seul code QR complet. Recadrez le texte et les boutons autour, puis partagez-la à nouveau.

# share_recovery_unreadable_image
source: In Photos, tap Share, tap Options, choose Most Compatible, then share the image to BlueWallet again.
es: En Fotos, toca Compartir, toca Opciones, elige Más compatible y vuelve a compartir la imagen con BlueWallet.
fr: Dans Photos, touchez Partager, Options, Le plus compatible, puis partagez à nouveau l’image avec BlueWallet.

# share_recovery_unsupported_image
source: In Photos, select exactly one image, tap Share, then choose BlueWallet. Do not select a video or multiple items.
es: En Fotos, selecciona exactamente una imagen, toca Compartir y elige BlueWallet. No selecciones un vídeo ni varios elementos.
fr: Dans Photos, sélectionnez une seule image, touchez Partager, puis choisissez BlueWallet. Ne sélectionnez pas de vidéo ni plusieurs éléments.
